app/views/vacancies/_form.html.erb

SELECT "vacancies".* FROM "vacancies" INNER JOIN "skills_vacancies" ON "vacancies"."id" = "skills_vacancies"."vacancy_id" WHERE "skills_vacancies"."skill_id" = 980190968
SELECT "workers".* FROM "workers" INNER JOIN "skills_workers" ON "workers"."id" = "skills_workers"."worker_id" WHERE "skills_workers"."skill_id" = 980190968
SELECT skills.*, vacancies.name, workers.name FROM "skills" INNER JOIN "skills_vacancies" ON "skills_vacancies"."skill_id" = "skills"."id" INNER JOIN "skills_workers" ON "skills_workers"."skill_id" = "skills"."id" INNER JOIN "skills_vacancies" "skills_vacancies_skills_join" ON "skills_vacancies_skills_join"."skill_id" = "skills"."id" INNER JOIN "vacancies" ON "vacancies"."id" = "skills_vacancies_skills_join"."vacancy_id" INNER JOIN "skills_workers" "skills_workers_skills_join" ON "skills_workers_skills_join"."skill_id" = "skills"."id" INNER JOIN "workers" ON "workers"."id" = "skills_workers_skills_join"."worker_id" WHERE (skills.id=980190968)
---
	    <td align="right"></td>
	    <td><%= select_tag 'vacancy', options_from_collection_for_select(Skill.all, "id", "name"), :name=>'worker[skill_sel]', :id=>'vacancy_select_skill', :include_blank => true  %>&nbsp;&nbsp;<%=link_to t(:label_add_skill), '#', :"data-href" =>"/vacancies/add_skill/#{@vacancy.id}", :id=>'v_skill_link', :remote=>true %>  </td>

SELECT COUNT(*) FROM "skills" INNER JOIN "skills_vacancies" ON "skills"."id" = "skills_vacancies"."skill_id" WHERE "skills_vacancies"."vacancy_id" = 980190971
---
	    	<div id="skills">
		    		<% if @vacancy.skills.size>0 %>