app/views/vacancies/_skills.html.erb

<ul style="width:200px;">
<% @vacancy.skills.each do |skill|%>
---
SELECT "skills".* FROM "skills" INNER JOIN "skills_vacancies" ON "skills"."id" = "skills_vacancies"."skill_id" WHERE "skills_vacancies"."vacancy_id" = 980190970