app/views/workers/_form.html.erb

    <td align="right"></td>
    <td><%= select_tag 'worker', options_from_collection_for_select(Skill.all, "id", "name"), :name=>'skill_sel', :id=>'worker_select_skill', :include_blank => true  %>&nbsp;&nbsp;<%=link_to t(:label_add_skill), '#', :"data-href" =>"/workers/add_skill/#{@worker.id}", :id=>'w_skill_link', :remote=>true %>  </td>
---
SELECT "skills".* FROM "skills" INNER JOIN "skills_workers" ON "skills"."id" = "skills_workers"."skill_id" WHERE "skills_workers"."worker_id" = 980190964

    	<div id="skills">
	    		<% if @worker.skills.size>0 %>
---
SELECT COUNT(*) FROM "skills" INNER JOIN "skills_vacancies" ON "skills"."id" = "skills_vacancies"."skill_id" WHERE "skills_vacancies"."worker_id" = 980190962