app/views/workers/_skills.html.erb

SELECT "skills".* FROM "skills" INNER JOIN "skills_workers" ON "skills"."id" = "skills_workers"."skill_id" WHERE "skills_workers"."worker_id" = 980190965
---
<ul style="width:500px;">
<% @worker.skills.each do |skill|%>