app/controllers/skills_controller.rb

DELETE FROM "skills" WHERE "skills"."id" = $1  [["id", 980190985]]
---
  def destroy
    flash[:notice] = t(:notice_successful_delete) if @skill.destroy