app/controllers/vacancies_controller.rb

SELECT "vacancies".* FROM "vacancies"
---
  def index
    @vacancy=Vacancy.all

INSERT INTO "vacancies" ("contacts", "created_at", "lifetime", "name", "salary", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["contacts", "contacts"], ["created_at", Wed, 28 Mar 2012 14:49:21 UTC +00:00], ["lifetime", 2012], ["name", "vacancy #1"], ["salary", 1000], ["updated_at", Wed, 28 Mar 2012 14:49:21 UTC +00:00]]
---
  def create
    @vacancy.lifetime = date_convert_from_post(params[:vacancy], :lifetime)
    @vacancy.name=params[:vacancy][:name]
    @vacancy.salary=params[:vacancy][:salary]
    @vacancy.contacts=params[:vacancy][:contacts]

    respond_to do |format|
      if @vacancy.save

UPDATE "vacancies" SET "updated_at" = '2012-03-29 08:52:42.660447', "contacts" = 'alex-dir@mail.ru' WHERE "vacancies"."id" = 980190974
---
  def update
    respond_to do |format|
      if  @vacancy.update_attributes(:lifetime=>date_convert_from_post(params[:vacancy], :lifetime), :name => params[:vacancy][:name], :salary => params[:vacancy][:salary], :contacts=>params[:vacancy][:contacts])

DELETE FROM "vacancies" WHERE "vacancies"."id" = $1  [["id", 980190965]]
---
  def destroy
    flash[:notice] = t(:notice_successful_delete) if @vacancy.destroy

SELECT "skills".* FROM "skills" INNER JOIN "skills_workers" ON "skills_workers"."skill_id" = "skills"."id" INNER JOIN "workers" ON "workers"."id" = "skills_workers"."worker_id" INNER JOIN "skills_vacancies" ON "skills"."id" = "skills_vacancies"."skill_id" WHERE "skills_vacancies"."vacancy_id" = 980190970
SELECT "workers".* FROM "workers" INNER JOIN "skills_workers" ON "workers"."id" = "skills_workers"."worker_id" WHERE "skills_workers"."skill_id" = 980190968
SELECT "skills".* FROM "skills"
---
  def find
    @workers=@vacancy.skills.joins(:skills_workers=>:worker).collect do |v|
      v.workers
    end

    @sub_workers=@vacancy.skills.map do |skill|

SELECT "skills".* FROM "skills"
INSERT INTO "skills" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 28 Mar 2012 13:40:54 UTC +00:00], ["name", "Имя"], ["updated_at", Wed, 28 Mar 2012 13:40:54 UTC +00:00]]
SELECT "skills".* FROM "skills" INNER JOIN "skills_vacancies" ON "skills"."id" = "skills_vacancies"."skill_id" WHERE "skills_vacancies"."vacancy_id" = 980190970
---
  def add_skill

    unless params[:selected_skill].empty?
      @vacancy.skills << Skill.find(params[:selected_skill])

SELECT "vacancies".* FROM "vacancies" WHERE "vacancies"."id" = $1 LIMIT 1  [["id", "980190970"]]
---
  def find_vacancy
    @vacancy = Vacancy.find(params[:id])