app/controllers/workers_controller.rb

SELECT "workers".* FROM "workers"
---
  def index
    @worker = Worker.all

INSERT INTO "workers" ("contacts", "created_at", "name", "salary", "skill_id", "status_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["contacts", nil], ["created_at", Wed, 28 Mar 2012 15:15:03 UTC +00:00], ["name", nil], ["salary", nil], ["skill_id", nil], ["status_id", nil], ["updated_at", Wed, 28 Mar 2012 15:15:03 UTC +00:00]]
---
  def create
    @worker.attributes=params[:worker]
    respond_to do |format|
      if @worker.save

UPDATE "workers" SET "updated_at" = '2012-03-30 08:15:44.860365', "status" = 'В поиске все еще' WHERE "workers"."id" = 980190968
---
  def update
    respond_to do |format|
      params[:worker].delete(:skills)
      #params[:worker].delete(:skill_sell)
      if  @worker.update_attributes(params[:worker])

DELETE FROM "workers" WHERE "workers"."id" = $1  [["id", 298486374]]
---
  def destroy
    flash[:notice] = t(:notice_successful_delete) if @worker.destroy

SELECT "skills".* FROM "skills" INNER JOIN "skills_vacancies" ON "skills_vacancies"."skill_id" = "skills"."id" INNER JOIN "vacancies" ON "vacancies"."id" = "skills_vacancies"."vacancy_id" INNER JOIN "skills_workers" ON "skills"."id" = "skills_workers"."skill_id" WHERE "skills_workers"."worker_id" = 980190964
SELECT "vacancies".* FROM "vacancies" INNER JOIN "skills_vacancies" ON "vacancies"."id" = "skills_vacancies"."vacancy_id" WHERE "skills_vacancies"."skill_id" = 980190991 AND (lifetime > '2012-03-29 09:20:29.113279')
SELECT "skills".* FROM "skills"
---
  def find
    @vacancy=@worker.skills.joins(:skills_vacancies=>:vacancy).collect do |v|
      v.vacancies.active
    end

    @sub_vacancies=@worker.skills.map do |skill|

SELECT "skills".* FROM "skills"
INSERT INTO "skills" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 28 Mar 2012 15:16:26 UTC +00:00], ["name", "undefined"], ["updated_at", Wed, 28 Mar 2012 15:16:26 UTC +00:00]]
SELECT "skills".* FROM "skills" INNER JOIN "skills_workers" ON "skills"."id" = "skills_workers"."skill_id" WHERE "skills_workers"."worker_id" = 980190964
---
  def add_skill

    unless params[:selected_skill].empty?
      @worker.skills << Skill.find(params[:selected_skill])

SELECT "workers".* FROM "workers" WHERE "workers"."id" = $1 LIMIT 1  [["id", "980190964"]]
---
  def find_worker
    @worker = Worker.find(params[:id])